mermaid nettverks
